Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: The knob offset can be set by :cpp:expr:`lv_arc_set_knob_offset(arc, offset_angle)`, and will only be visible if :cpp:enumerator:`LV_PART_KNOB` is visible.
it_it: L'offset della manopola può essere impostato con :cpp:expr:`lv_arc_set_knob_offset(arc, offset_angle)` e sarà visibile solo se lo è :cpp:enumerator:`LV_PART_KNOB`.

source: The last argument of the registration function must be ``void * user_data`` and the same ``user_data`` needs to be passed as the last argument of the callback.
it_it: L'ultimo argomento della funzione di registrazione deve essere ``void * user_data`` e lo stesso ``user_data`` deve essere passato come ultimo argomento della callback.

source: The last command also sets the current directory to the build directory.
it_it: L'ultimo comando imposta anche la directory corrente sulla directory di build.

source: The last element must be :c:macro:`LV_GRID_TEMPLATE_LAST`.
it_it: L'ultimo elemento deve essere :c:macro:`LV_GRID_TEMPLATE_LAST`.

source: The last parameter can be ``NULL`` or an attribute list, like this:
it_it: L'ultimo parametro può essere ``NULL`` o un elenco di attributi, come questo:

source: The last parameter of :cpp:func:`lv_obj_add_event_cb` is a pointer to any custom data that will be available in the event.
it_it: L'ultimo parametro di :cpp:func:`lv_obj_add_event_cb` è un puntatore a eventuali dati personalizzati che saranno disponibili nell'evento.

source: The latest ESP32-S3 has 256kb RAM available for this (before FreeRTOS and any other initialization starts taking chunks out).
it_it: L'ultimo ESP32-S3 ha 256kb di RAM disponibili per questo (prima che FreeRTOS e qualsiasi altra inizializzazione comincino a prelevare blocchi).

source: The latter two functions are useful when you already know ``name`` is among the properties of a specific Widget class, or is a style name, since a property name may exist in both lists.
it_it: Le ultime due funzioni sono utili quando si sa già che ``name`` è tra le proprietà di una specifica classe Widget o è un nome di stile, poiché un nome di proprietà può esistere in entrambi gli elenchi.

source: The layout of the files should look like this::
it_it: Il layout dei file dovrebbe apparire così:

source: The layouts of the ``TEXT`` modes contain "keys" to change mode.
it_it: I layout delle modalità ``TEXT`` contengono "tasti" per cambiare modalità.

source: The left panel is a typical "project-tree" navigation panel.
it_it: Il pannello di sinistra è un tipico pannello di navigazione "project-tree".

source: The length of the indicator against the background indicates the Bar's current value.
it_it: La lunghezza dell'indicatore rispetto allo sfondo indica il valore corrente della Bar.

source: The length of the ticks can be configured with the length Style property on the :cpp:enumerator:`LV_PART_INDICATOR` for major ticks and :cpp:enumerator:`LV_PART_ITEMS` for minor ticks.
it_it: La lunghezza delle tacche può essere configurata con la proprietà "length Style" su :cpp:enumerator:`LV_PART_INDICATOR` per le tacche principali e :cpp:enumerator:`LV_PART_ITEMS` per le tacche secondarie.

source: The library version for ST was updated to ``revC`` so the path component ``cortex_m33`` must be updated to ``cortex_m33_revC`` in STM32CubeIDE.
it_it: La versione della libreria per ST è stata aggiornata a ``revC`` quindi il componente del path ``cortex_m33`` deve essere aggiornato a ``cortex_m33_revC`` in STM32CubeIDE.

source: The linear (or skew) gradient are similar to horizontal or vertical gradient but the angle of the gradient can be controlled.
it_it: Il gradiente lineare (o skew) è simile al gradiente orizzontale o verticale, ma l'angolo del gradiente può essere controllato.

source: The linear gradient will be rendered along a line defined by 2 points.
it_it: Il gradiente lineare verrà renderizzato lungo una linea definita da 2 punti.

source: The links are to the whole API page, not to the symbols.
it_it: I link sono all'intera pagina API, non ai simboli

source: The list can be created on any side.
it_it: L'elenco può essere creato su qualsiasi lato.

source: The list is shown/hidden on open/close.
it_it: L'elenco viene mostrato/nascosto all'apertura/chiusura.

source: The list items are passed to the Drop-Down List as a newline-separated list in a string as the ``options`` argument to :cpp:expr:`lv_dropdown_set_options(dropdown, options)`.
it_it: Gli elementi dell'elenco vengono passati alla Drop-Down List come elenco "newline-separated" in una stringa come argomento ``options`` a :cpp:expr:`lv_dropdown_set_options(dropdown, options)`.

source: The list of "union-ed" fields at this writing are:
it_it: L'elenco dei campi "union-ed" al momento della stesura di questo articolo è:

source: The list of highlighted dates should be stored in a :cpp:struct:`lv_calendar_date_t` array and applied to the Calendar by calling :cpp:expr:`lv_calendar_set_highlighted_dates(calendar, highlighted_dates, date_num)`.
it_it: L'elenco delle date evidenziate deve essere memorizzato in un array :cpp:struct:`lv_calendar_date_t` e applicato al Calendario chiamando :cpp:expr:`lv_calendar_set_highlighted_dates(calendar, highlighted_dates, date_num)`.

source: The list of states is covered below.
it_it: L'elenco degli stati è illustrato di seguito.

source: The list of symbols (or prefixes) can be separated by commas or spaces, and they can wrap onto subsequent lines of text so long as they are indented.
it_it: L'elenco dei simboli (o prefissi) può essere separato da virgole o spazi e può essere inserito nelle righe di testo successive, purché siano indentate.

source: The list sequence determines the order in which the Spans are displayed.
it_it: La sequenza dell'elenco determina l'ordine in cui gli Span vengono visualizzati.

source: The location in the Build Directory where components are installed by the do_install task.
it_it: La posizione nella Build Directory in cui i componenti vengono installati dal task do_install.

source: The location in the Build Directory where unpacked recipe source code resides.
it_it: Posizione nella "Build Directory" in cui risiede il codice sorgente della ricetta spacchettata.

source: The log file contains LVGL logs and the wayland messages.
it_it: Il file di log contiene i log LVGL e i messaggi Wayland.

source: The logging subsystem of LVGL relies on the ESP-IDF presence of the printf.
it_it: Il sottosistema di logging di LVGL si basa sulla presenza di printf in ESP-IDF.

source: The lv_fs_littlefs extension is an interface to the littlefs library.
it_it: L'estensione lv_fs_littlefs è un'interfaccia alla libreria littlefs.

source: The lv_image_colorkey_t contains two color values: `high_color` and `low_color`.
it_it: lv_image_colorkey_t contiene due valori di colore: `high_color` e `low_color`.

source: The lv_qrcode LVGL extension is an interface to that library which implements a custom Widget that generates and displays QR Codes using the library.
it_it: L'estensione LVGL lv_qrcode è un'interfaccia a tale libreria che implementa un widget personalizzato che genera e visualizza codici QR utilizzando la libreria.

source: The lv_svg extension provides makes it possible to use SVG images in your LVGL UI using the `Scalable Vector Graphics (SVG) Tiny 1.2 Specification <https://www.w3.org/TR/SVGTiny12/>`__.
it_it: L'estensione lv_svg consente di utilizzare immagini SVG nell'interfaccia utente LVGL utilizzando la specifica `Scalable Vector Graphics (SVG) Tiny 1.2 <https://www.w3.org/TR/SVGTiny12/>`__.

source: The lv_tiny_ttf extension allows using TrueType fonts in LVGL using the `stb_truetype 3rd-Party Library <https://github.com/nothings/stb>`__.
it_it: L'estensione lv_tiny_ttf consente di utilizzare font TrueType in LVGL `tramite la Libreria di Terze Parti stb_truetype <https://github.com/nothings/stb>`__.

source: The lvgl library (``.so`` files) are also ready to be installed in the final image.
it_it: Anche la libreria lvgl (file ``.so``) è pronta per essere installata nell'immagine finale.

source: The main callback called during an Animation (when it is playing) is called an *animator* function, which has the following prototype:
it_it: La callback principale chiamata durante un'Animazione (durante la riproduzione) è chiamata funzione *animator*, che ha il seguente prototipo:

source: The main characteristics of Components are:
it_it: Le caratteristiche principali dei componenti sono:

source: The main characteristics of Widgets are:
it_it: Le caratteristiche principali dei Widget sono:

source: The main components of LVGL's Drawing API are the :cpp:func:`lv_draw_rect`, :cpp:func:`lv_draw_label`, :cpp:func:`lv_draw_image`, and similar functions.
it_it: I componenti principali dell'API di Disegno di LVGL sono le funzioni :cpp:func:`lv_draw_rect`, :cpp:func:`lv_draw_label`, :cpp:func:`lv_draw_image` e simili.

source: The main differences are that pure Image Widget transformations:
it_it: Le principali differenze sono che le trasformazioni pure del Widget Image:

source: The main entry point is a ``<project_name>_init("asset_path")`` function located in ``<project_name>.c``.
it_it: Il punto di ingresso principale è una funzione ``<project_name>_init("asset_path")`` situata in ``<project_name>.c``.

source: The main fields of :cpp:type:`lv_draw_fill_dsc_t` are straightforward.
it_it: I campi principali di :cpp:type:`lv_draw_fill_dsc_t` sono semplici.

source: The main part can either show the selected item or static text.
it_it: La parte principale può mostrare l'elemento selezionato o un testo statico.

source: The main purpose for this driver is for testing/debugging the LVGL application in a **Linux** simulation window.
it_it: Lo scopo principale di questo driver è testare/eseguire il debug dell'applicazione LVGL in una finestra di simulazione **Linux**.

source: The main purpose of parts is to allow styling individual "components" of a widget.
it_it: Lo scopo principale delle parti è consentire di definire lo stile dei singoli "componenti" di un widget.

source: The main purpose of this driver is for testing/debugging LVGL applications in a **Windows** simulation window via **simulator mode**, or developing standard **Windows** desktop applications with LVGL via **application mode**.
it_it: Lo scopo principale di questo driver è testare/debuggare applicazioni LVGL in una finestra di simulazione di **Windows** tramite la **simulator mode**, o sviluppare applicazioni desktop standard di **Windows** con LVGL tramite la **application mode**.

source: The main reason for enabling OS features is for multi-core rendering.
it_it: Il motivo principale per cui si abilitano le funzionalità del sistema operativo è il rendering multi-core.

source: The main sketch file (``.ino``)
it_it: Il file dello sketch principale (``.ino``)

source: The main source repository for LVGL specifying the master branch.
it_it: Il repository sorgente principale per LVGL che specifica il branch master.

source: The major tick value is calculated with the :cpp:expr:`lv_map` API (when not setting custom labels), this calculation takes into consideration the total number of ticks and the Scale range, so the label drawn can present rounding errors when the calculated value is a floating-point value.
it_it: Il valore della tacca principale viene calcolato con l'API :cpp:expr:`lv_map` (quando non si impostano etichette personalizzate); questo calcolo tiene conto del numero totale di tacche e dell'intervallo della "Scale", quindi l'etichetta disegnata può presentare errori di arrotondamento quando il valore calcolato è un valore in virgola mobile.

source: The mask is always center-aligned.
it_it: La maschera è sempre allineata al centro.

source: The maximum number of characters can be limited using :cpp:expr:`lv_textarea_set_max_length(textarea, max_char_num)`.
it_it: Il numero massimo di caratteri può essere limitato utilizzando :cpp:expr:`lv_textarea_set_max_length(textarea, max_char_num)`.

source: The maximum number of stops is limited to :c:macro:`LV_GRADIENT_MAX_STOPS`.
it_it: Il numero massimo di stop è limitato a :c:macro:`LV_GRADIENT_MAX_STOPS`.

source: The maximum number of tiles can be set using the function :cpp:expr:`lv_display_set_tile_cnt(disp, cnt)`.
it_it: Il numero massimo di tile può essere impostato utilizzando la funzione :cpp:expr:`lv_display_set_tile_cnt(disp, cnt)`.

source: The memory :cpp:func:`lv_snapshot_take` uses is dynamically allocated using :cpp:func:`lv_draw_buf_create`.
it_it: La memoria utilizzata da :cpp:func:`lv_snapshot_take` viene allocata dinamicamente tramite :cpp:func:`lv_draw_buf_create`.

source: The memory occupied by the stroke is strongly related to the path length.
it_it: La memoria occupata dal tratto è strettamente correlata alla lunghezza del percorso.

source: The merit of having asymmetrical cores is that your application can run theoretically run low-priority workloads efficiently on the HE core and delegate time critical, processing intensive workloads to the HP core.
it_it: Il vantaggio di avere core asimmetrici è che l'applicazione può teoricamente eseguire carichi di lavoro a bassa priorità in modo efficiente sul core HE e delegare carichi di lavoro critici e ad alta intensità di elaborazione al core HP.

source: The message box can be modal (blocking clicks on the rest of the screen) or not modal.
it_it: La finestra di messaggio può essere modale (bloccando i clic sul resto dello schermo) o non modale.

source: The message box is built from other Widgets, so you can check these Widgets' documentation for details.
it_it: La finestra di messaggio è costruita a partire da altri widget, quindi si può consultare la documentazione di questi Widget per i dettagli.

source: The method to hide it varies depending on the platform.
it_it: Il metodo per nasconderlo varia a seconda della piattaforma.

source: The migration will not break the project,.
it_it: La migrazione non interromperà il progetto.

source: The minimal initialisation opening a window and enabling keyboard/mouse support
it_it: Inizializzazione minima che apre una finestra e abilita il supporto per tastiera/mouse

source: The minimal requirements are:
it_it: I requisiti minimi sono:

source: The minimum Windows OS requirement for this driver is Windows Vista RTM.
it_it: Il requisito minimo del sistema operativo Windows per questo driver è Windows Vista RTM.

source: The minimum length of the scrollbar is fixed to 10, while its maximum length is limited by the Widget's height or width, depending on whether the scrollbar is vertical or horizontal.
it_it: La lunghezza minima della barra di scorrimento è fissata a 10, mentre la lunghezza massima è limitata dall'altezza o dalla larghezza del widget, a seconda che la barra sia verticale o orizzontale.

source: The mode can be changed with :cpp:expr:`lv_slider_set_mode(slider, LV_SLIDER_MODE_...)`
it_it: La modalità può essere modificata con :cpp:expr:`lv_slider_set_mode(slider, LV_SLIDER_MODE_...)`

source: The mode can be selected by calling :cpp:func:`lv_windows_create_display`.
it_it: La modalità può essere selezionata chiamando :cpp:func:`lv_windows_create_display`.

source: The mode can be set by :cpp:expr:`lv_arc_set_mode(arc, LV_ARC_MODE_...)` and has no effect until angle is set by :cpp:func:`lv_arc_set_value` or value of the Arc is changed by pointer input (finger, mouse, etc.).
it_it: La modalità può essere impostata tramite :cpp:expr:`lv_arc_set_mode(arc, LV_ARC_MODE_...)` e non ha effetto finché l'angolo non viene impostato tramite :cpp:func:`lv_arc_set_value` o il valore dell'arco non viene modificato tramite l'input del puntatore (dito, mouse, ecc.).

source: The mode in :cpp:func:`lv_fs_open` can be :cpp:enumerator:`LV_FS_MODE_WR` to open for writes only, :cpp:enumerator:`LV_FS_MODE_RD` for reads only, or :cpp:enumerator:`LV_FS_MODE_RD` ``|`` :cpp:enumerator:`LV_FS_MODE_WR` for both.
it_it: La modalità in :cpp:func:`lv_fs_open` può essere :cpp:enumerator:`LV_FS_MODE_WR` per aprire solo in scrittura, :cpp:enumerator:`LV_FS_MODE_RD` per solo in lettura o :cpp:enumerator:`LV_FS_MODE_RD` ``|`` :cpp:enumerator:`LV_FS_MODE_WR` per entrambe.

source: The mode selection callback is called before the display is initialized.
it_it: La callback di selezione della modalità viene chiamata prima dell'inizializzazione del display.

source: The modified line should look similar to this:
it_it: La riga modificata dovrebbe essere simile a questa:

source: The most common usage for BitBake is ``bitbake recipename``, where ``recipename`` is the name of the recipe you want to build (referred to as the "target").
it_it: L'uso più comune di BitBake è ``bitbake recipename``, dove ``recipename`` è il nome della ricetta che si desidera compilare (definito come "target").

source: The most common way to create a screen is by creating a :ref:`Base widget <base_widget>` with a ``NULL`` parent.
it_it: Il modo più comune per creare uno screen è creare un :ref:`Widget di Base <base_widget>` con un genitore ``NULL``.

source: The most fundamental of all widgets is the Base Widget, on which all other widgets are based.
it_it: Il più fondamentale di tutti è il Widget Base, su cui si basano tutti gli altri widget.

source: The most important special keys in your :cpp:func:`read_cb` function are:
it_it: I tasti speciali più importanti nella funzione :cpp:func:`read_cb` sono:

source: The most recent cursor added appears on top.
it_it: Il cursore aggiunto più di recente appare in alto.

source: The most recently added style has higher precedence.
it_it: Lo stile aggiunto più di recente ha la precedenza.

source: The movement needs to be:
it_it: Il movimento deve essere:

source: The name is normally extracted from the recipe file name.
it_it: Il nome viene normalmente estratto dal nome del file della ricetta.

source: The name of the Component can be used as an XML tag in the ``<view>`` of other Components, Screens, and Widgets.
it_it: Il nome del Componente può essere utilizzato come tag XML nella ``<view>`` di altri Componenti, Schermate e Widget.

source: The name of the XML file will also be the name of the Screen.
it_it: Il nome del file XML sarà anche il nome della Schermata.

source: The name of these files is the name of the folder containing the ``globals.xml`` file by default.
it_it: Il nome di questi file è quello della cartella che contiene il file ``globals.xml`` per default.

source: The name to reference the font later
it_it: Il nome per fare riferimento al font in seguito

source: The names of the colors are as follows:
it_it: I nomi dei colori sono i seguenti:

source: The names of the days can be adjusted with :cpp:expr:`lv_calendar_set_day_names(calendar, day_names)` where ``day_names`` looks like ``const char * day_names[7] = {"Su", "Mo", ...};`` Only the pointer of the day names is saved so the array should have static or global scope.
it_it: I nomi dei giorni possono essere modificati con :cpp:expr:`lv_calendar_set_day_names(calendar, day_names)` dove ``day_names`` è simile a ``const char * day_names[7] = {"Su", "Mo", ...};`` Viene salvato solo il puntatore dei nomi dei giorni, quindi l'array dovrebbe avere un ambito statico o globale.

source: The new Screen will become active (returned by :cpp:func:`lv_screen_active`) when the animation starts after ``delay`` time.
it_it: Il nuovo Screen diventerà attivo (restituito da :cpp:func:`lv_screen_active`) quando l'animazione inizia dopo il tempo ``delay``.

source: The new language can be retrieved by either calling :cpp:expr:`lv_translation_get_language()` or by getting the event parameter in the event callback with :cpp:expr:`lv_event_get_param(e)`
it_it: La nuova lingua può essere recuperata chiamando :cpp:expr:`lv_translation_get_language()` o ottenendo il parametro evento nella callback dell'evento con :cpp:expr:`lv_event_get_param(e)`

source: The new value in :cpp:func:`lv_bar_set_value` can be set with or without an animation depending on the last parameter (``LV_ANIM_ON/OFF``).
it_it: Il nuovo valore in :cpp:func:`lv_bar_set_value` può essere impostato con o senza animazione a seconda dell'ultimo parametro (``LV_ANIM_ON/OFF``).

source: The non-style Widget properties available for a given Widget are implemented at the top of that Widget's primary ``.c`` file as a ``const`` id-to-function-pointer lookup array, like this example for the Label Widget:
it_it: Le proprietà Widget non di stile disponibili per un dato Widget vengono implementate all'inizio del file ``.c`` primario del Widget come array di ricerca ``const`` da-id-a-puntatore-a-funzione, come in questo esempio per il Widget Label:

source: The normal comment prefix ``/**`` causes the comment to document the code member *after* the comment.
it_it: Il normale prefisso di commento ``/**`` fa sì che il commento documenti il pezzo di codice *dopo* il commento.

source: The note ends with a blank line, the end of the comment, or another Doxygen command that starts a new section.
it_it: La nota termina con una riga vuota, la fine del commento o un altro comando Doxygen che inizia una nuova sezione.

source: The number of Animations that can be playing at the same time for a given object with a given *animator* callback is one (1).
it_it: Il numero di Animazioni riproducibili contemporaneamente per un dato oggetto con una data callback *animator* è uno (1).

source: The number of Spans that can be added is limited only by available RAM.
it_it: Il numero di Span che possono essere aggiunti è limitato solo dalla RAM disponibile.

source: The number of buttons neither includes the newline elements nor the terminating element of the array.
it_it: Il numero di pulsanti non include né gli elementi di "newline" né l'elemento di chiusura dell'array.

source: The number of buttons, their positions and text are controlled by a descriptor string array, called a *map*, passed to :cpp:expr:`lv_buttonmatrix_set_map(btn_matrix, my_map)`.
it_it: Il numero di pulsanti, le loro posizioni e il testo sono controllati da un array di stringhe descrittive, chiamato *map*, passato a :cpp:expr:`lv_buttonmatrix_set_map(btn_matrix, my_map)`.

source: The number of elements must be equal to the number of buttons.
it_it: Il numero di elementi deve essere uguale a quello dei pulsanti.

source: The number of elements will be passed as a separate parameter.
it_it: Il numero di elementi verrà passato come parametro separato.

source: The number of horizontal and vertical division lines can be modified by :cpp:expr:`lv_chart_set_div_line_count(chart, hdiv_num, vdiv_num)`.
it_it: Il numero di linee di divisione orizzontali e verticali può essere modificato tramite :cpp:expr:`lv_chart_set_div_line_count(chart, hdiv_num, vdiv_num)`.

source: The number of points in the series can be modified by :cpp:expr:`lv_chart_set_point_count(chart, point_num)`.
it_it: Il numero di punti nella serie può essere modificato con :cpp:expr:`lv_chart_set_point_count(chart, point_num)`.

source: The number of visible rows can be adjusted with :cpp:expr:`lv_roller_set_visible_row_count(roller, num)`.
it_it: Il numero di righe visibili può essere regolato con :cpp:expr:`lv_roller_set_visible_row_count(roller, num)`.

source: The object hierarchy of a freshly-created File Explorer looks like this:
it_it: La gerarchia degli oggetti di un File Explorer appena creato si presenta così:

source: The objective here is to create a recipe from scratch and to add the generated binary in the image.
it_it: L'obiettivo qui è creare una ricetta da zero e aggiungere il binario generato all'immagine.

source: The objective is to add this library as a shared object in the target rootfs, and also to generate a SDK with lvgl.
it_it: L'obiettivo è aggiungere questa libreria come oggetto "shared" nel rootfs target e generare un SDK con lvgl.
